Examinator/src/InformationRegisters/ПрохожденияОбученияСУО/ПрохожденияОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноОбщениеМеждуУчастниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/УчебныеГруппыСУО/УчебныеГруппыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/КаталогМероприятийСУО/КаталогМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогМероприятийСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАудитории</name>
    <type>
      <types>CatalogRef.ТипыАудиторийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольПреподавателя</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождениеЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПовторноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Темы</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.СодержаниеМероприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПриПроведении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПреподаватели</name>
    <attributes>
      <name>РольПреподавателя</name>
      <type>
        <types>CatalogRef.РолиПреподавателейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотрВедомости</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/СводнаяВедомостьСУО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, ПравоеЗначение, ЦветТекста)
	
	НовоеОформление = УсловноеОформление.Элементы.Добавить();
	
	НовоеОформление.Использование = Истина;
	НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный; 
	НовоеОформление.ПредставлениеПользовательскойНастройки = "Оформление мероприятия """ + ДанныеОМероприятии.Наименование +""""; 
	
	Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие));
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование    = Истина;
	Отбор.Представление    = "Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Отбор.ПравоеЗначение   = ПравоеЗначение;
	
	Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВыделятьЦветом");
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование    = Истина;
	Отбор.Представление    = "ВыделятьЦветом";
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Отбор.ПравоеЗначение   = Истина;
	
	ЭлементОформленияЦветФона = НовоеОформление.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементОформленияЦветФона.Значение      = ЦветТекста;
	ЭлементОформленияЦветФона.Использование = Истина;
	
	// Устанавливаем поле для оформления
	
	ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие)); 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВедомость()
	
	Мероприятия.Очистить();
	Ведомость.Очистить();
	УсловноеОформление.Элементы.Очистить();
	
	УдаляемыеРеквизиты        = Новый Массив();
	МассивРеквизитовВедомости = ПолучитьРеквизиты("Ведомость");
	
	Для каждого РеквизитВедомости Из МассивРеквизитовВедомости Цикл
	
		Если Найти(РеквизитВедомости.Имя, "Мероприятие_") = 1 Тогда
			УдаляемыеРеквизиты.Добавить(РеквизитВедомости.Путь + "." + РеквизитВедомости.Имя);
		КонецЕсли;
		
		Если Найти(РеквизитВедомости.Имя, "ПрохождениеМероприятие_") = 1 Тогда
			УдаляемыеРеквизиты.Добавить(РеквизитВедомости.Путь + "." + РеквизитВедомости.Имя);
		КонецЕсли;
		
		
	КонецЦикла;
	
	ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяРеквизитаМероприятия(Мероприятие)
	
	Идентификатор = Строка(Мероприятие.УникальныйИдентификатор());
	Идентификатор = СтрЗаменить(Идентификатор, "-", "_");	
	
	Возврат "Мероприятие_" + Идентификатор;
	
КонецФункции

&НаСервере
Процедура ДобавитьМероприятиеВВедомость(НовоеМероприятие, ЗаполнятьВедомость=Истина)
	
	// Получаем данные
	
	ЭтоЭлектронныйРесурс = ?(ТипЗнч(НовоеМероприятие) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
	
	Если ЭтоЭлектронныйРесурс Тогда
		ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НовоеМероприятие, "Наименование");
	Иначе
		ДанныеОМероприятии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НовоеМероприятие, "Наименование, Вид");
	КонецЕсли;
	
	// Ищем ранее добавленное мероприятие
	
	Для каждого Строка Из Мероприятия Цикл
	
		Если НовоеМероприятие = Строка.Мероприятие Тогда
			Возврат; // Выходим и ничего не делаем
		КонецЕсли;
	
	КонецЦикла;
	
	// Добавляем мероприятие в таблицу мероприятий
	
	НоваяСтрока = Мероприятия.Добавить();	
	
	НоваяСтрока.Мероприятие         = НовоеМероприятие;
	НоваяСтрока.ИмяКолонкиВедомости = ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	НоваяСтрока.ВыставляетсяОценка  = ?(ЭтоЭлектронныйРесурс, Истина, ДанныеОМероприятии.Вид.ВыставляетсяОценка);	
	
	// Добавляем реквизиты к ведомости (для каждого мероприятия своя колонка).
	
	ДобавляемыеРеквизиты = Новый Массив();

	ТипыЗначений = Новый Массив();
	ТипыЗначений.Добавить(Тип("СправочникСсылка.ЭлементыШкалыОценокСУО"));
	ТипыЗначений.Добавить(Тип("ПеречислениеСсылка.СтатусыПрохожденияОбъектовСУО"));
	
	// Реквизит для хранения оценок и статусов прохождения
	
	НовыйРеквизит = Новый РеквизитФормы(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
										Новый ОписаниеТипов(ТипыЗначений),
										"Ведомость",
										ДанныеОМероприятии.Наименование,
										Ложь); 
										
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);									
	
	// Реквизит для хранения ссылки на документ прохождения мероприятия
	
	НовыйРеквизит = Новый РеквизитФормы("Прохождение" + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
										Новый ОписаниеТипов("ДокументСсылка.ПрохождениеОбученияСУО"),
										"Ведомость",
										"Прохождение обучения " + ДанныеОМероприятии.Наименование,
										Ложь); 
										
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);									
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,);

		
	// Добавляем элементы формы для отображения добавленных реквизитов.
	
	ЭлементФормы = Элементы.Добавить(ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие),
									 Тип("ПолеФормы"),
									 Элементы.Ведомость); 	
	
				  
	ЭлементФормы.Вид                  = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным          = "Ведомость." + ПолучитьИмяРеквизитаМероприятия(НовоеМероприятие);
	ЭлементФормы.Заголовок            = ДанныеОМероприятии.Наименование;
	
	// Добавляем условное оформление
	
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил, ЦветаСтиля.ПоложительныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат, ЦветаСтиля.ПоложительныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил, ЦветаСтиля.ОтрицательныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.НеДопущен, ЦветаСтиля.ОтрицательныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Проходит, ЦветаСтиля.НейтральныйСтатусСУ);
	ДобавитьУсловноеОформлениеМероприятия(НовоеМероприятие, ДанныеОМероприятии, Перечисления.СтатусыПрохожденияОбъектовСУО.Зачислен, ЦветаСтиля.НейтральныйСтатусДопСУ);

		
	Если ЗаполнятьВедомость Тогда
		ЗаполнитьВедомость();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВедомость()
	
	МассивМероприятий   = Мероприятия.Выгрузить(,"Мероприятие");
	МассивПользователей = Ведомость.Выгрузить(,"Пользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохожденияОбученияСУОСрезПоследних.ШкалаОценки,
		|	ПрохожденияОбученияСУОСрезПоследних.Баллы,
		|	ПрохожденияОбученияСУОСрезПоследних.Статус,
		|	ПрохожденияОбученияСУОСрезПоследних.Пользователь,
		|	ПрохожденияОбученияСУОСрезПоследних.Сценарий КАК Мероприятие,
		|	ПрохожденияОбученияСУОСрезПоследних.Регистратор КАК ПрохождениеОбучения
		|ИЗ
		|	РегистрСведений.ПрохожденияОбученияСУО.СрезПоследних(
		|			,
		|			Сценарий В (&Мероприятие)
		|				И Пользователь В (&Пользователь)) КАК ПрохожденияОбученияСУОСрезПоследних";

	Запрос.УстановитьПараметр("Мероприятие", МассивМероприятий);
	Запрос.УстановитьПараметр("Пользователь", МассивПользователей);

	Результат = Запрос.Выполнить();

	ТаблицаРезультатов = Результат.Выгрузить();

    Для каждого СтрокаВедомость Из Ведомость Цикл
	
		Для каждого СтрокаМероприятие Из Мероприятия Цикл
			
			ПараметрыПоиска = Новый Структура("Пользователь, Мероприятие", СтрокаВедомость.Пользователь, СтрокаМероприятие.Мероприятие);
			
			Результаты = ТаблицаРезультатов.НайтиСтроки(ПараметрыПоиска);
			
			Если Результаты.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока       = Результаты[0];
			ИмяКолонкиМероприятия = ПолучитьИмяРеквизитаМероприятия(НайденнаяСтрока.Мероприятие);
			ИмяКолонкиПрохождения = "Прохождение" + ИмяКолонкиМероприятия;
			
			СтрокаВедомость[ИмяКолонкиПрохождения] = НайденнаяСтрока.ПрохождениеОбучения;
			СтрокаВедомость[ИмяКолонкиМероприятия] = Неопределено;
			
			Если Показывать = "Статус" Тогда
				
				СтрокаВедомость[ИмяКолонкиМероприятия] = НайденнаяСтрока.Статус;
				
			ИначеЕсли Показывать = "ОценкуИлиСтатус" Тогда
				
				Если (НайденнаяСтрока.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
					ИЛИ НайденнаяСтрока.Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
					И СтрокаМероприятие.ВыставляетсяОценка Тогда
					СтрокаВедомость[ИмяКолонкиМероприятия] = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(НайденнаяСтрока.Баллы, НайденнаяСтрока.ШкалаОценки);
				Иначе
					СтрокаВедомость[ИмяКолонкиМероприятия] = НайденнаяСтрока.Статус;
				КонецЕсли;
				
			Иначе
				
				Если (НайденнаяСтрока.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
					И НайденнаяСтрока.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат)
					ИЛИ НЕ СтрокаМероприятие.ВыставляетсяОценка Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				СтрокаВедомость[ИмяКолонкиМероприятия] = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(НайденнаяСтрока.Баллы, НайденнаяСтрока.ШкалаОценки);
				
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЦикла;
	
	Ведомость.Сортировать("Пользователь");
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ТаблицаПользователей = Ведомость.Выгрузить(,"Пользователь");
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем настройки
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		Показывать = ДанныеНастроек.Получить("Показывать");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Показывать) Тогда
		Показывать = "Оценку";
	КонецЕсли;
	
	// Заполняем ведомость на основе параметров
	
	Если ЗначениеЗаполнено(Параметры.Мероприятие) Тогда
		ДобавитьМероприятиеВВедомость(Параметры.Мероприятие, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		ДобавитьМероприятиеВВедомость(Параметры.ЭлектронныйРесурс, Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПрограммаОбучения) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СодержаниеПрограммыОбученияСУО.Мероприятие
			|ИЗ
			|	Справочник.СодержаниеПрограммыОбученияСУО КАК СодержаниеПрограммыОбученияСУО
			|ГДЕ
			|	СодержаниеПрограммыОбученияСУО.Владелец = &ПрограммаОбучения
			|	И СодержаниеПрограммыОбученияСУО.ЭтоГруппа = ЛОЖЬ";

		Запрос.УстановитьПараметр("ПрограммаОбучения", Параметры.ПрограммаОбучения);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Мероприятие) Тогда
				ДобавитьМероприятиеВВедомость(ВыборкаДетальныеЗаписи.Мероприятие, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.УчебнаяГруппа) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
			|ИЗ
			|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
			|ГДЕ
			|	УчебныеГруппыСУОСостав.Ссылка = &УчебнаяГруппа";

		Запрос.УстановитьПараметр("УчебнаяГруппа", Параметры.УчебнаяГруппа);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	ПараметрОтбораСотрудников = Неопределено;
	
	Если ЗначениеЗаполнено(Параметры.Должность) Тогда
		ПараметрОтбораСотрудников    = "Должность";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		ПараметрОтбораСотрудников    = "Организация";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПодразделениеОрганизации) Тогда
		ПараметрОтбораСотрудников    = "ПодразделениеОрганизации";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПодразделениеПредприятия) Тогда
		ПараметрОтбораСотрудников    = "ПодразделениеПредприятия";
	КонецЕсли;
	
	Если ПараметрОтбораСотрудников <> Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.СотрудникиСУО.СрезПоследних(, Уволен = ЛОЖЬ) КАК СотрудникиСУОСрезПоследних
			|ГДЕ
			|	СотрудникиСУОСрезПоследних."+ПараметрОтбораСотрудников+" = &ПараметрОтбора";

		Запрос.УстановитьПараметр("ПараметрОтбора", Параметры[ПараметрОтбораСотрудников]);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.МассивЭлектронныхРесурсов <> Неопределено Тогда
		
		Для каждого ЭлектронныйРесурс Из Параметры.МассивЭлектронныхРесурсов Цикл
			ДобавитьМероприятиеВВедомость(ЭлектронныйРесурс, Ложь);	
		КонецЦикла;
			
	КонецЕсли;
	
	Если Параметры.МассивПользователей <> Неопределено Тогда
		
		Для каждого Пользователь Из Параметры.МассивПользователей Цикл
			НоваяСтрока = Ведомость.Добавить();
			НоваяСтрока.Пользователь = Пользователь;
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ДобавитьМероприятие.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО");
	
	ЗаполнитьВедомость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ДобавитьМероприятие(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьМероприятиеПродолжение", ЭтотОбъект);		
		
	ОткрытьФорму("Справочник.КаталогМероприятийСУО.ФормаВыбора",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМероприятиеПродолжение(НовоеМероприятие, ДополнительныеПараметры) Экспорт
	
	Если НовоеМероприятие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьМероприятиеВВедомость(НовоеМероприятие);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьЭлектронныйРесурс(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьМероприятиеПродолжение", ЭтотОбъект);
	
	ПараметрыФормы   = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьВедомость();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьВедомость();
КонецПроцедуры

&НаКлиенте
Процедура ПодборПользователей(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Ведомость);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьПриИзменении(Элемент)
	ЗаполнитьВедомость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ Ведомость

&НаКлиенте
Процедура ВедомостьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Найти(Поле.Имя, "Мероприятие_") = 1 Тогда
		
		ПрохождениеОбучения = ТекущиеДанные["Прохождение" + Поле.Имя];

		Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		
			ПоказатьЗначение(,ПрохождениеОбучения);
			
		Иначе
			
			ПоказатьЗначение(,ТекущиеДанные.Пользователь);
			
		КонецЕсли;
		
		
	Иначе
		
		ПоказатьЗначение(,ТекущиеДанные.Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВедомостьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Ведомость.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл		
			
		НоваяСтрока = Ведомость.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь;
		
	КонецЦикла;
	
	ЗаполнитьВедомость();

КонецПроцедуры
